import 'package:mafia/models/lastMove.dart';

class LastMoves {
  static List<LastMove> moves = [
    LastMove(
        name: 'تابلو',
        description: """یک نفر را انتخاب کن.
  آن بازیکن باید شخصیتش را به همه اعلام کند""",
        color: 'R'),
    LastMove(
        name: 'شهر در امان است',
        description:
            """مافیا، قاتل حرفه ای، جانی، دست کج و جادوگر امشب کاری نمی کنند و همچنین سندیکا، بمب ساز و فدایی فردا کاری انجام نمی دهند.
        (ولی گرگ نما اگر نوبتش باشد کارش را انجام میدهد)""",
        color: 'B'),
    LastMove(
        name: 'کارت به کارت',
        description: """کارت دو نفر از بازیکنان را با هم جا به جا کن.
        بازیکنان هویت کارت جدید را پیدا میکنند""",
        color: 'R'),
    LastMove(
        name: 'شب مثل روز روشن',
        description:
            """هر اتفاقی که امشب رخ دهد توسط گرداننده توضیح داده خواهد شد.
        به غیر از اتفاقات مربوط به شخصیت های مستقل
        (گرداننده اعلام میکند هر شخصیت کدام بازیکن را انتخاب کرده است)""",
        color: 'R'),
    LastMove(
        name: 'افشای هویت',
        description: """کارت خودت را به همه نشان بده""",
        color: 'W'),
    LastMove(
        name: 'مافیا + 1',
        description: """شرایط برد تغییر میکند.
        از حالا مافیا با تعداد برابر برنده نمیشود و برای بردن باید تعدادشان حداقل یک نفر بیشتر از شهروند ها باشد.""",
        color: 'R'),
    LastMove(
        name: 'حدس آخر',
        description: """یک نفر را انتخاب کن و جلوی همه به گرداننده بگو.
        اگر شخصیتش رو درست بگی، توی بازی میمونی.
        (به غیر از شخصیت هایی ک رو شدند)""",
        color: 'R'),
    LastMove(
        name: 'هرج و مرج',
        description:
            """گرداننده همه کارت ها را جمع میکند، بر میزند و دوباره به بازیکنان حاظر در بازی می دهد.
        هر شخص، هویت کارت جدید خود را پیدا میکند.
        بازی را به همین شکل ادامه دهید""",
        color: 'R'),
    LastMove(
        name: 'متهم ردیف اول',
        description: """یک نفر را انتخاب کن.
        این شخص فردا خود به خود به مرحله دوم رای گیری می رود و رای گیری مرحله اول، بین بقیه بازیکنان انجام میشود.""",
        color: 'B'),
    LastMove(
        name: 'یک تیر دو نشون',
        description:
            """فردا رای گیری روال خودش را دارد با این تفاوت که به جای یک نفر، حتما باید دونفر از طریق رای گیری حذف شوند.
    (شهردار، قاضی، وکیل و جلب کاری انجام نمیدهند)""",
        color: 'B'),
    LastMove(
        name: 'یک روز سکوت',
        description: """یک نفر را انتخاب کن.
    آن شخص به مدت 24 ساعت نباید حرفی بزند.
    (دنگ هم نمی تواند بزند)""",
        color: 'B'),
    LastMove(
        name: 'حذف با حقیقت',
        description: """یک نفر را انتخاب کن.
    ابندا باید بین حذف یا حقیقت یکی را انتخاب کند.
    حقیقت: یک سوال بپرس و فرد منتخب باید در حضور جمع جواب درست بدهد.
    حذف: آن بازیکن از بازی خارج می شود.""",
        color: 'B'),
    LastMove(
        name: 'مستقل در منجلاب',
        description: """تا آخر بازی:
    لیست سندیکا تعطیل می شود،
    هزار چهره قابلیت آینه وار خود را از دست می دهد،
    و همه گرگ نماها قدرت تکثیر خود را از دست میدهند.""",
        color: 'R'),
    LastMove(
        name: 'ظلمات',
        description: """امشب هیچ کدام از شهروندان نمی توانند کاری انجام دهند.
    ولی
    جانی باید کارش انجام دهد حتی اگر شب فرد باشد""",
        color: 'D'),
    LastMove(
        name: 'بدشانس',
        description:
            """گرداننده همه کارت هارا جمع میکند و به صورت تصادفی یک کارت را از بازی خارج میکند.
    صاحب کارت حذف می گردد.""",
        color: 'R'),
    LastMove(
        name: 'مافیای باد آورده',
        description: """یک شخصیت مافیایی نام ببر.
    اسم صاحب شخصیت در جمع اعلام میشود.
    از شخصیت های نبش قبر شده نمی توانید استفاده کنید و حتما باید از شخصیت هایی باشد که از ابتدا داخل بازی بوده اند""",
        color: 'W'),
    LastMove(
        name: 'شب مافیایی',
        description: """امشب فقط نقش های مافیایی کارشان را انجام می دهند""",
        color: 'D'),
    LastMove(
        name: 'زهر آخر',
        description: """امشب مافیا کسی را نمی کشند.
    بازیکنی را که تو انتخاب میکنی امشب کشته میشود.
    اسمش را به گرداننده اعلام کن اگر بازیکن نجات نیابد فردا صبح از بازی خارج می شود.""",
        color: 'B'),
    LastMove(
        name: 'اخبار شب',
        description:
            """کارت کسانی ک امشب خارج میشوند برای همه فردا صبح رو میشود""",
        color: 'W'),
    LastMove(
        name: 'خواب عمیق',
        description:
            """امشب تک تک اعضای مافیا، دکتر، کارآگاه، قهرمان و زندانبان کاری انجام نمیدهند
    (حمله گروهی مافیاسرجایش است)""",
        color: 'B'),
    LastMove(
        name: 'غم از دست رفته',
        description: """یک نفر را انتخاب کن.
    فردا از غصه رفتن تو، عزادار است و کلا در رای گیری شرکت داده نمی شود.""",
        color: 'W'),
    LastMove(
        name: 'تسخیر روح',
        description: """یک نفر را انتخاب کن و فقط به گرداننده بگو.
    آن بازیکن ظاهرا در بازی هست، اما در واقع حذف شده!
    نه قابلیتی دارد، نه توی آمار هست و نه رای او شمرده میشود.""",
        color: 'D'),
  ];
}
