import 'package:Mafia/models/role.dart';

class Roles {
  List<Role> mafia = [
    Role(
        name: 'گادفادر',
        type: 'M',
        order: 1,
        job: 'رئیس مافیا که تصمیم نهایی در اعمال مافیا را میگیرد'),
    Role(
        name: 'معشوقه',
        type: 'M',
        order: 2,
        job:
            "بعد از گادفادر حق تیر با معشوقه میباشد اگر در روز حذف شود در شب گادفادر از خشم دو نفر از شهروندان را میکشد"),
    Role(
        name: 'وکیل',
        type: 'M',
        order: 3,
        job:
            "در یکی از شب ها میتواند تصمیم بگیر یک شهروند عادی یا رویین تن بدون سپر را تبدیل به مافیا کند"),
    Role(
        name: 'تهمت زن',
        type: 'M',
        order: 4,
        job:
            "هر شب به یکی از بازیکنانتهمت میزند و اگر کار آگاه استعلام آن شخص را بگیرد مافیا اعلام میشود"),
    Role(
        name: 'ناتاشا',
        type: 'M',
        order: 5,
        job:
            "ناتاشا در شب به یکی از بازیکن ها سکوت میدهد آن بازیکن در روز بعد نمیتواند حرف بزند یا حرف دیگران را تایید یا رد کند و حتی در رای گیری نیز شرکت نمیکند ، ناتاشا نمیتواند یک نفر را در دو شب متوالی سکوت دهد"),
    Role(
        name: 'تروریست',
        type: 'M',
        order: 9,
        job: "در صورت حذف شدن در روز میتواند یک شهروند را با خود حذف کند"),
  ];
  List<Role> citizen = [
    Role(
        name: 'ساقی',
        type: 'C',
        order: -2,
        job:
            " او باید در فاز شب یکی از بازیکنان را انتخاب کند؛ بازیکن مذکور اصطلاحاً مست می‌شود. وظیفه ساقی پیدا کردن گادفادر و ناتاشا در بازی و معرفی آن‌ها به تیم شهروندان است. اگر ساقی در شب به گادفادر اشاره کند، گادفادر مست می‌شود و شلیکش بی اثر خواهد شد. در این شرایط لرد اعلام می‌کند که تیر گادفادر به سنگ خورد. اگر ساقی به ناتاشا اشاره کند، ناتاشا مست شده، نه تنها نمی‌تواند کسی را سکوت بدهد، بلکه به خودش سکوت می‌خورد. \n اگر ساقی در شب به تروریست اشاره کند و تروریست درست در رأی گیری روز بعد توسط شهروندان کشته شود، دیگر نمی‌تواند کسی را ترور کند و اصطلاحاً دفیوز می‌شود. ساقی هم مانند ناتاشا نمی‌تواند در دو شب متوالی به یک نفر اشاره کند. اگر ساقی به کارآگاه اشاره کند، استعلام او برعکس خواهد شد و اگر به دکتر اشاره کند، دکتر دیگر قادر به سیو نخواهد بود؛ بنابراین او باید دقت کند که نقش‌های مثبت را مورد هدف قرار ندهد. \n اگر ساقی به اسنایپر اشاره کند و اسنایپر شلیک کند، تیرش به خودش بر می‌گردد. اگر ساقی در فاز شب به رویین‌تن اشاره کند، او خاصیت رویین بودنش را از دست می‌دهد و اگر به او شلیک شود، کشته خواهد شد. اگر به تروریست اشاره کند، تروریست مست شده و در روز بعد دیفیوز می‌شود؛ اما در همان شبی که مست شده، استعلامش توسط کارگاه منفی می‌شود"),
    Role(
        name: 'قاضی',
        type: 'C',
        order: -1,
        job:
            "میتواند در یک شب و فقط یکبار در بازی رای های روز قبل را باطل اعلام کند"),
    Role(
        name: 'جاسوس',
        type: 'C',
        order: -1,
        job:
            "همراه مافیا بیدار میشه ولی مافیا نباید بفهمه در روز هیچ اشاره ای به نقشش نباید بکنه"),
    Role(
        name: 'دکتر',
        type: 'C',
        order: 11,
        job:
            "در شب به اول و دوم دو نفر و در شب سوم به بعد یک نفر را میتواند از تیر مافیا نجات دهد"),
    Role(
        name: 'تک تیر انداز',
        type: 'C',
        order: 12,
        job:
            "در شب میتواند یک نفر به قتل برساند  اگر مقتول شهروند باشد خود تک تیر انداز نیز حذف میشود اگر گادفادر باشد تیرش بدون تاثیر خواهد بود و اگر دیگر تقش های مافیا باشد در شب بعد نیز میتواند این عمل را انجام دهد"),
    Role(
        name: 'کاراگاه',
        type: 'C',
        order: 13,
        job:
            "میتواند استعلام یکی از بازیکنان را از خدای بازی بگیرد  اگر استعلام گاد فادر را بگیرد خدای بازی  او را شهروند اعلام میکند"),
    Role(
        name: 'رویین تن',
        type: 'C',
        order: 14,
        job: "در شب یک بار از تیر مافیا جون سالم به در میبرد"),
    Role(
        name: 'کشیش',
        type: 'C',
        order: 15,
        job:
            "در مقابل نقش ناتاشا قرار دارد و میتواند در شب یک نفر را انتخاب کند اگر ناتاشا آن را سکوت داده باشد دسکوت او را بشکند"),
    Role(
        name: 'همزاد',
        type: 'C',
        order: 19,
        job:
            "در شب یک نفر را انتخاب میکند در صورت حذف آن بازیکن نقشش به همزاد میرسد"),
  ];
}
